"""
3. Напишите программу, которая у пользователя запрашивает две точки (верхний
левый гол, нижний правый угол) на координатной плоскости, например (2,3), (3,5). По
этим двум точкам строится прямоугольник. Подсчитать периметр прямоугольника,
площадь прямоугольника. Далее программа запрашивает еще две точки (верхний левый
гол, нижний правый угол) на координатной плоскости, например (1,1), (4,4) второго
прямоугольника. Определить прямоугольники пересекаются хотя бы по одной стороне
или нет.
"""