'''Задача 1 Написать программу: дан список из 10 чисел, которые задаются с помощью
датчика случайных чисел в диапазоне 1-10. Программа находит повторяющиеся
элементы и удаляет их из списка. Например, дан список (1,1,1,2,3,4,2,3,4) результат
(1,2,3,4)'''

import random

for i in [1..10]:

a=[random.randint(1,10)]
print(a)


# a = [1,1,2,3,1,5,10,1,4]
# print(type(a))
# a=set(a)
#
# print(a)
# print(type(a))
